ЛИС2/src/Documents/лис_АктОтбораПроб/лис_АктОтбораПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_АктОтбораПроб</name>
  <registerRecords>AccumulationRegister.лис_ОтобранныеПробы</registerRecords>
  <registerRecords>InformationRegister.лис_ОтборПроб</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПлана</name>
    <type>
      <types>DocumentRef.лис_ПланОтбораПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораПроб</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
      <types>CatalogRef.Водозаборы</types>
      <types>CatalogRef.СелитебныеЗоны</types>
      <types>CatalogRef.Скважины</types>
      <types>CatalogRef.СанитарноЗащитныеЗоны</types>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельОтбораПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборудованиеДляОтбораПроб</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияУсловияПроведенияАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияТранспортировкиИХраненияПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВодыПриОтборе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаВМестеОтбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативныеДокументы</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНД</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования1</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПолучил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтобралПробу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствовалПриОтбореПроб</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробуПринял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатНаружнегоОсмотраПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИДатаДоставкиВЛабораторию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пробы</name>
    <attributes>
      <name>ТочкаОтбораПробы</name>
      <type>
        <types>CatalogRef.ТочкиКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпределяемыйПоказатель</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕмкостиДляОтбораПроб</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеПринадлежности</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПробы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КонсервантыДляАнализа</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеРеактивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ШифрПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/InformationRegisters/лис_ОтборПроб/лис_ОтборПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ОтборПроб</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕмкостиДляОтбораПроб</name>
    <type>
      <types>CatalogRef.лис_ЛабораторныеПринадлежности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервантыДляАнализа</name>
    <type>
      <types>CatalogRef.лис_ЛабораторныеРеактивы</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/AccumulationRegisters/лис_ОтобранныеПробы/лис_ОтобранныеПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>лис_ОтобранныеПробы</name>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЛИС2/src/Enums/РазделыУчетаЭкоаналитическогоКонтроля/РазделыУчетаЭкоаналитическогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчетаЭкоаналитическогоКонтроля</name>
  <enumValues>
    <name>ПромышленныеВыбросы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныйВоздух</name>
  </enumValues>
  <enumValues>
    <name>СточныеВоды</name>
  </enumValues>
  <enumValues>
    <name>ПриродныеВоды</name>
  </enumValues>
  <enumValues>
    <name>Почвы</name>
  </enumValues>
  <enumValues>
    <name>ДонныеОтложения</name>
  </enumValues>
  <enumValues>
    <name>ФизическиеФакторы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныеОсадки</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Documents/лис_АктОтбораПроб/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр лис_ОтборПроб
	Движения.лис_ОтборПроб.Записывать = Истина;
	Для Каждого ТекСтрокаПробы Из Пробы Цикл
		Движение = Движения.лис_ОтборПроб.Добавить();
		Движение.Период = Дата;
		Движение.ШифрПробы = ТекСтрокаПробы.ШифрПробы;
		Движение.ОбъемПробы = ТекСтрокаПробы.ОбъемПробы;
		Движение.ТочкаОтбораПробы = ТекСтрокаПробы.ТочкаОтбораПробы;
		Движение.ОпределяемыйПоказатель = ТекСтрокаПробы.ОпределяемыйПоказатель;
		Движение.ЕмкостиДляОтбораПроб = ТекСтрокаПробы.ЕмкостиДляОтбораПроб;
		Движение.ЕдиницаИзмерения = ТекСтрокаПробы.ЕдиницаИзмерения;
		Движение.КонсервантыДляАнализа = ТекСтрокаПробы.КонсервантыДляАнализа;
		Движение.Примечание = ТекСтрокаПробы.Примечание;
	КонецЦикла;

	// регистр лис_ОтобранныеПробы Приход
	Движения.лис_ОтобранныеПробы.Записывать = Истина;
	Для Каждого ТекСтрокаПробы Из Пробы Цикл
		Движение = Движения.лис_ОтобранныеПробы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДатаОтбора = ДатаОтбора;
		Движение.РегистрационныйНомерПробы = РегистрационныйНомерПробы;
		Движение.ШифрПробы = ТекСтрокаПробы.ШифрПробы;
		Движение.ОбъемПробы = ТекСтрокаПробы.ОбъемПробы;
		Движение.ЕдиницаИзмерения = ТекСтрокаПробы.ЕдиницаИзмерения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

// galaktionovva; Улучшение #70 - Начало
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РазделУчета = Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.ПромышленныеВыбросы Тогда 
		ТочкаОтбораПробы = ПроверяемыеРеквизиты.Найти("Пробы.ТочкаОтбораПробы");
		Если Не ТочкаОтбораПробы = Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(ТочкаОтбораПробы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// galaktionovva; Улучшение #70 - Конец
